node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "filenames"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "../../recData/movieLens1m_201809\\train.csv"
      }
    }
  }
}
node {
  name: "compression_type"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 262144
      }
    }
  }
}
node {
  name: "string_to_index/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 8712
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 8712
          }
        }
        string_val: "click_seq_86190"
        string_val: "click_seq_5630"
        string_val: "click_seq_1873"
        string_val: "click_seq_2726"
        string_val: "click_seq_8153"
        string_val: "click_seq_1275"
        string_val: "click_seq_38798"
        string_val: "click_seq_6049"
        string_val: "click_seq_38095"
        string_val: "click_seq_2396"
        string_val: "click_seq_159"
        string_val: "click_seq_185135"
        string_val: "click_seq_151455"
        string_val: "click_seq_166183"
        string_val: "click_seq_900"
        string_val: "click_seq_5767"
        string_val: "click_seq_3244"
        string_val: "click_seq_82499"
        string_val: "click_seq_5963"
        string_val: "click_seq_131724"
        string_val: "click_seq_5178"
        string_val: "click_seq_91094"
        string_val: "click_seq_2279"
        string_val: "click_seq_3111"
        string_val: "click_seq_3715"
        string_val: "click_seq_80083"
        string_val: "click_seq_179133"
        string_val: "click_seq_6554"
        string_val: "click_seq_270"
        string_val: "click_seq_1387"
        string_val: "click_seq_2321"
        string_val: "click_seq_92046"
        string_val: "click_seq_1396"
        string_val: "click_seq_6624"
        string_val: "click_seq_6012"
        string_val: "click_seq_1241"
        string_val: "click_seq_3578"
        string_val: "click_seq_1073"
        string_val: "click_seq_412"
        string_val: "click_seq_101360"
        string_val: "click_seq_49647"
        string_val: "click_seq_3103"
        string_val: "click_seq_6869"
        string_val: "click_seq_136602"
        string_val: "click_seq_6214"
        string_val: "click_seq_58107"
        string_val: "click_seq_102"
        string_val: "click_seq_27704"
        string_val: "click_seq_4402"
        string_val: "click_seq_39292"
        string_val: "click_seq_164367"
        string_val: "click_seq_90384"
        string_val: "click_seq_8169"
        string_val: "click_seq_46723"
        string_val: "click_seq_155812"
        string_val: "click_seq_163645"
        string_val: "click_seq_81257"
        string_val: "click_seq_250"
        string_val: "click_seq_1429"
        string_val: "click_seq_4111"
        string_val: "click_seq_4919"
        string_val: "click_seq_7073"
        string_val: "click_seq_2518"
        string_val: "click_seq_27695"
        string_val: "click_seq_1825"
        string_val: "click_seq_106648"
        string_val: "click_seq_357"
        string_val: "click_seq_39234"
        string_val: "click_seq_4833"
        string_val: "click_seq_1192"
        string_val: "click_seq_42728"
        string_val: "click_seq_131749"
        string_val: "click_seq_112006"
        string_val: "click_seq_70492"
        string_val: "click_seq_7150"
        string_val: "click_seq_3623"
        string_val: "click_seq_1582"
        string_val: "click_seq_148652"
        string_val: "click_seq_2710"
        string_val: "click_seq_5065"
        string_val: "click_seq_4835"
        string_val: "click_seq_129333"
        string_val: "click_seq_87194"
        string_val: "click_seq_2661"
        string_val: "click_seq_6338"
        string_val: "click_seq_101142"
        string_val: "click_seq_4770"
        string_val: "click_seq_71"
        string_val: "click_seq_7162"
        string_val: "click_seq_6086"
        string_val: "click_seq_143472"
        string_val: "click_seq_5564"
        string_val: "genres_Film-Noir"
        string_val: "click_seq_132153"
        string_val: "click_seq_1399"
        string_val: "click_seq_5246"
        string_val: "click_seq_3051"
        string_val: "click_seq_112552"
        string_val: "click_seq_6807"
        string_val: "click_seq_4436"
        string_val: "click_seq_1599"
        string_val: "click_seq_145418"
        string_val: "click_seq_1042"
        string_val: "click_seq_27873"
        string_val: "click_seq_158254"
        string_val: "click_seq_3230"
        string_val: "click_seq_6059"
        string_val: "click_seq_127108"
        string_val: "click_seq_95218"
        string_val: "click_seq_2871"
        string_val: "click_seq_766"
        string_val: "click_seq_71205"
        string_val: "click_seq_2947"
        string_val: "click_seq_72378"
        string_val: "click_seq_1140"
        string_val: "click_seq_7192"
        string_val: "click_seq_71494"
        string_val: "click_seq_102194"
        string_val: "click_seq_175"
        string_val: "click_seq_79501"
        string_val: "click_seq_1658"
        string_val: "click_seq_4500"
        string_val: "click_seq_8864"
        string_val: "click_seq_94150"
        string_val: "click_seq_6692"
        string_val: "click_seq_3893"
        string_val: "click_seq_8491"
        string_val: "click_seq_120625"
        string_val: "click_seq_4903"
        string_val: "click_seq_92234"
        string_val: "click_seq_8338"
        string_val: "click_seq_95949"
        string_val: "click_seq_4229"
        string_val: "click_seq_229"
        string_val: "click_seq_96737"
        string_val: "click_seq_6294"
        string_val: "click_seq_6378"
        string_val: "click_seq_152037"
        string_val: "click_seq_58293"
        string_val: "click_seq_57502"
        string_val: "click_seq_1212"
        string_val: "click_seq_145839"
        string_val: "click_seq_92427"
        string_val: "click_seq_55276"
        string_val: "click_seq_39435"
        string_val: "click_seq_43419"
        string_val: "click_seq_8987"
        string_val: "click_seq_2902"
        string_val: "click_seq_2718"
        string_val: "click_seq_122896"
        string_val: "click_seq_4010"
        string_val: "click_seq_8626"
        string_val: "click_seq_7584"
        string_val: "click_seq_155168"
        string_val: "click_seq_174479"
        string_val: "click_seq_30898"
        string_val: "click_seq_179817"
        string_val: "click_seq_1257"
        string_val: "click_seq_69685"
        string_val: "click_seq_1100"
        string_val: "click_seq_48394"
        string_val: "click_seq_4803"
        string_val: "click_seq_51662"
        string_val: "click_seq_2796"
        string_val: "click_seq_36477"
        string_val: "click_seq_53140"
        string_val: "click_seq_33672"
        string_val: "click_seq_4683"
        string_val: "click_seq_426"
        string_val: "click_seq_46855"
        string_val: "click_seq_4238"
        string_val: "click_seq_112370"
        string_val: "click_seq_6947"
        string_val: "click_seq_257"
        string_val: "click_seq_888"
        string_val: "click_seq_5339"
        string_val: "click_seq_27193"
        string_val: "click_seq_1449"
        string_val: "click_seq_4966"
        string_val: "click_seq_4580"
        string_val: "click_seq_70336"
        string_val: "click_seq_26750"
        string_val: "click_seq_5902"
        string_val: "click_seq_61011"
        string_val: "click_seq_7844"
        string_val: "click_seq_1515"
        string_val: "click_seq_220"
        string_val: "click_seq_6872"
        string_val: "click_seq_5062"
        string_val: "click_seq_4067"
        string_val: "click_seq_97024"
        string_val: "click_seq_4448"
        string_val: "click_seq_1312"
        string_val: "click_seq_143410"
        string_val: "click_seq_4280"
        string_val: "click_seq_3289"
        string_val: "click_seq_3537"
        string_val: "click_seq_45880"
        string_val: "click_seq_133798"
        string_val: "click_seq_147196"
        string_val: "click_seq_104925"
        string_val: "click_seq_938"
        string_val: "click_seq_3424"
        string_val: "click_seq_1432"
        string_val: "click_seq_6564"
        string_val: "click_seq_137345"
        string_val: "click_seq_176601"
        string_val: "click_seq_4477"
        string_val: "click_seq_8012"
        string_val: "click_seq_52604"
        string_val: "click_seq_81564"
        string_val: "click_seq_5213"
        string_val: "click_seq_5512"
        string_val: "click_seq_32898"
        string_val: "click_seq_3506"
        string_val: "click_seq_43556"
        string_val: "click_seq_7620"
        string_val: "click_seq_1642"
        string_val: "click_seq_55067"
        string_val: "click_seq_33166"
        string_val: "click_seq_508"
        string_val: "click_seq_7051"
        string_val: "click_seq_139640"
        string_val: "click_seq_5205"
        string_val: "click_seq_69529"
        string_val: "click_seq_1672"
        string_val: "click_seq_74789"
        string_val: "click_seq_27762"
        string_val: "click_seq_4678"
        string_val: "click_seq_3157"
        string_val: "click_seq_94070"
        string_val: "click_seq_157312"
        string_val: "click_seq_149146"
        string_val: "click_seq_783"
        string_val: "click_seq_4732"
        string_val: "click_seq_147384"
        string_val: "click_seq_92391"
        string_val: "click_seq_53956"
        string_val: "click_seq_2433"
        string_val: "click_seq_4663"
        string_val: "click_seq_37444"
        string_val: "click_seq_3108"
        string_val: "click_seq_4035"
        string_val: "click_seq_2618"
        string_val: "click_seq_3410"
        string_val: "click_seq_2790"
        string_val: "click_seq_2351"
        string_val: "click_seq_1231"
        string_val: "click_seq_1236"
        string_val: "click_seq_8385"
        string_val: "click_seq_50514"
        string_val: "click_seq_71254"
        string_val: "click_seq_26631"
        string_val: "click_seq_5282"
        string_val: "click_seq_6368"
        string_val: "click_seq_6695"
        string_val: "click_seq_1556"
        string_val: "click_seq_258"
        string_val: "click_seq_3323"
        string_val: "click_seq_78142"
        string_val: "click_seq_89039"
        string_val: "click_seq_2387"
        string_val: "click_seq_1028"
        string_val: "click_seq_2565"
        string_val: "click_seq_75446"
        string_val: "click_seq_139655"
        string_val: "click_seq_2354"
        string_val: "click_seq_6434"
        string_val: "click_seq_7173"
        string_val: "click_seq_37384"
        string_val: "click_seq_80860"
        string_val: "click_seq_502"
        string_val: "click_seq_2922"
        string_val: "click_seq_62792"
        string_val: "click_seq_1614"
        string_val: "click_seq_6009"
        string_val: "click_seq_5060"
        string_val: "click_seq_898"
        string_val: "click_seq_6684"
        string_val: "click_seq_71147"
        string_val: "click_seq_5696"
        string_val: "click_seq_167064"
        string_val: "click_seq_66785"
        string_val: "click_seq_32799"
        string_val: "click_seq_7340"
        string_val: "click_seq_3767"
        string_val: "click_seq_4420"
        string_val: "click_seq_100302"
        string_val: "click_seq_3639"
        string_val: "click_seq_3990"
        string_val: "click_seq_1019"
        string_val: "click_seq_3711"
        string_val: "click_seq_100507"
        string_val: "click_seq_26078"
        string_val: "click_seq_2070"
        string_val: "click_seq_8008"
        string_val: "click_seq_4322"
        string_val: "click_seq_70545"
        string_val: "click_seq_6628"
        string_val: "click_seq_96964"
        string_val: "click_seq_698"
        string_val: "click_seq_85259"
        string_val: "click_seq_38"
        string_val: "click_seq_5999"
        string_val: "click_seq_639"
        string_val: "click_seq_178827"
        string_val: "click_seq_3869"
        string_val: "click_seq_2259"
        string_val: "click_seq_479"
        string_val: "click_seq_94896"
        string_val: "click_seq_2644"
        string_val: "click_seq_173619"
        string_val: "click_seq_3685"
        string_val: "click_seq_31114"
        string_val: "click_seq_981"
        string_val: "click_seq_1572"
        string_val: "click_seq_1061"
        string_val: "click_seq_2349"
        string_val: "click_seq_180265"
        string_val: "click_seq_4386"
        string_val: "click_seq_31184"
        string_val: "click_seq_6182"
        string_val: "click_seq_7024"
        string_val: "click_seq_90531"
        string_val: "click_seq_3183"
        string_val: "click_seq_178323"
        string_val: "click_seq_5073"
        string_val: "click_seq_26413"
        string_val: "click_seq_461"
        string_val: "click_seq_71518"
        string_val: "click_seq_26865"
        string_val: "click_seq_3313"
        string_val: "click_seq_132496"
        string_val: "click_seq_36527"
        string_val: "click_seq_2367"
        string_val: "click_seq_136838"
        string_val: "click_seq_7156"
        string_val: "click_seq_86000"
        string_val: "click_seq_267"
        string_val: "click_seq_92507"
        string_val: "click_seq_180497"
        string_val: "click_seq_6809"
        string_val: "click_seq_26630"
        string_val: "click_seq_210"
        string_val: "click_seq_150604"
        string_val: "click_seq_9004"
        string_val: "click_seq_3142"
        string_val: "click_seq_680"
        string_val: "click_seq_3241"
        string_val: "click_seq_7027"
        string_val: "click_seq_4995"
        string_val: "click_seq_85"
        string_val: "click_seq_53921"
        string_val: "click_seq_1426"
        string_val: "click_seq_8238"
        string_val: "click_seq_3330"
        string_val: "click_seq_69131"
        string_val: "click_seq_95170"
        string_val: "click_seq_55167"
        string_val: "click_seq_1095"
        string_val: "click_seq_71106"
        string_val: "click_seq_1273"
        string_val: "click_seq_157108"
        string_val: "click_seq_94985"
        string_val: "click_seq_8968"
        string_val: "click_seq_731"
        string_val: "click_seq_169912"
        string_val: "click_seq_8984"
        string_val: "click_seq_50003"
        string_val: "click_seq_4823"
        string_val: "click_seq_921"
        string_val: "click_seq_1497"
        string_val: "click_seq_356"
        string_val: "click_seq_34520"
        string_val: "click_seq_80864"
        string_val: "click_seq_2941"
        string_val: "click_seq_4089"
        string_val: "click_seq_189"
        string_val: "click_seq_48214"
        string_val: "click_seq_136864"
        string_val: "click_seq_52952"
        string_val: "click_seq_7193"
        string_val: "click_seq_103772"
        string_val: "click_seq_332"
        string_val: "click_seq_6705"
        string_val: "click_seq_4757"
        string_val: "click_seq_3873"
        string_val: "click_seq_26562"
        string_val: "click_seq_130686"
        string_val: "click_seq_8774"
        string_val: "click_seq_32589"
        string_val: "click_seq_8119"
        string_val: "click_seq_36519"
        string_val: "click_seq_3478"
        string_val: "click_seq_67695"
        string_val: "click_seq_173317"
        string_val: "click_seq_148671"
        string_val: "click_seq_80846"
        string_val: "click_seq_8879"
        string_val: "click_seq_1137"
        string_val: "click_seq_33830"
        string_val: "click_seq_27667"
        string_val: "click_seq_48385"
        string_val: "click_seq_73160"
        string_val: "click_seq_2611"
        string_val: "click_seq_25757"
        string_val: "click_seq_160567"
        string_val: "click_seq_68554"
        string_val: "click_seq_91630"
        string_val: "click_seq_102025"
        string_val: "click_seq_7190"
        string_val: "click_seq_8848"
        string_val: "click_seq_6502"
        string_val: "click_seq_125914"
        string_val: "click_seq_7394"
        string_val: "click_seq_61628"
        string_val: "click_seq_2772"
        string_val: "click_seq_6249"
        string_val: "click_seq_3628"
        string_val: "click_seq_45208"
        string_val: "click_seq_55280"
        string_val: "click_seq_76293"
        string_val: "click_seq_1412"
        string_val: "click_seq_165551"
        string_val: "click_seq_69481"
        string_val: "click_seq_27660"
        string_val: "click_seq_4339"
        string_val: "click_seq_136020"
        string_val: "click_seq_46231"
        string_val: "click_seq_5540"
        string_val: "click_seq_1466"
        string_val: "click_seq_71268"
        string_val: "click_seq_2819"
        string_val: "click_seq_8866"
        string_val: "click_seq_45186"
        string_val: "click_seq_5483"
        string_val: "click_seq_30883"
        string_val: "click_seq_82053"
        string_val: "click_seq_3752"
        string_val: "click_seq_93610"
        string_val: "click_seq_2532"
        string_val: "click_seq_34271"
        string_val: "click_seq_104"
        string_val: "click_seq_8908"
        string_val: "click_seq_77798"
        string_val: "click_seq_3169"
        string_val: "click_seq_2488"
        string_val: "click_seq_59421"
        string_val: "click_seq_59387"
        string_val: "click_seq_112788"
        string_val: "click_seq_3696"
        string_val: "click_seq_40732"
        string_val: "click_seq_1592"
        string_val: "click_seq_6020"
        string_val: "click_seq_3496"
        string_val: "click_seq_164753"
        string_val: "click_seq_3150"
        string_val: "click_seq_84637"
        string_val: "click_seq_34405"
        string_val: "rating_counts_1"
        string_val: "click_seq_165"
        string_val: "click_seq_5250"
        string_val: "click_seq_6382"
        string_val: "click_seq_100159"
        string_val: "click_seq_517"
        string_val: "click_seq_7153"
        string_val: "click_seq_1753"
        string_val: "click_seq_5668"
        string_val: "click_seq_103107"
        string_val: "click_seq_4329"
        string_val: "click_seq_53996"
        string_val: "click_seq_101612"
        string_val: "click_seq_1091"
        string_val: "click_seq_63222"
        string_val: "click_seq_3409"
        string_val: "click_seq_1036"
        string_val: "click_seq_33966"
        string_val: "click_seq_223"
        string_val: "click_seq_123545"
        string_val: "click_seq_96832"
        string_val: "click_seq_122892"
        string_val: "click_seq_48744"
        string_val: "click_seq_1454"
        string_val: "click_seq_44759"
        string_val: "click_seq_40819"
        string_val: "click_seq_5573"
        string_val: "click_seq_5197"
        string_val: "click_seq_184987"
        string_val: "click_seq_7451"
        string_val: "click_seq_8033"
        string_val: "click_seq_3167"
        string_val: "click_seq_6188"
        string_val: "click_seq_350"
        string_val: "click_seq_36401"
        string_val: "click_seq_3743"
        string_val: "click_seq_26796"
        string_val: "click_seq_1968"
        string_val: "click_seq_165549"
        string_val: "click_seq_53129"
        string_val: "click_seq_56782"
        string_val: "click_seq_50"
        string_val: "click_seq_118082"
        string_val: "click_seq_147372"
        string_val: "click_seq_5390"
        string_val: "click_seq_4310"
        string_val: "click_seq_32298"
        string_val: "click_seq_3871"
        string_val: "click_seq_5450"
        string_val: "click_seq_6982"
        string_val: "click_seq_6565"
        string_val: "click_seq_133365"
        string_val: "click_seq_8526"
        string_val: "click_seq_2624"
        string_val: "click_seq_5619"
        string_val: "click_seq_60904"
        string_val: "click_seq_193583"
        string_val: "click_seq_5322"
        string_val: "click_seq_27020"
        string_val: "click_seq_4236"
        string_val: "click_seq_141890"
        string_val: "click_seq_1381"
        string_val: "click_seq_86355"
        string_val: "genres_Crime"
        string_val: "click_seq_89090"
        string_val: "screen_year_0"
        string_val: "click_seq_537"
        string_val: "click_seq_8290"
        string_val: "click_seq_37731"
        string_val: "click_seq_1517"
        string_val: "click_seq_135567"
        string_val: "click_seq_133545"
        string_val: "click_seq_106927"
        string_val: "click_seq_27778"
        string_val: "click_seq_7202"
        string_val: "click_seq_27837"
        string_val: "click_seq_748"
        string_val: "click_seq_1101"
        string_val: "click_seq_2372"
        string_val: "click_seq_8587"
        string_val: "click_seq_4578"
        string_val: "click_seq_187541"
        string_val: "click_seq_106785"
        string_val: "click_seq_361"
        string_val: "click_seq_122433"
        string_val: "click_seq_3402"
        string_val: "click_seq_8376"
        string_val: "click_seq_26002"
        string_val: "click_seq_3802"
        string_val: "click_seq_3492"
        string_val: "click_seq_109383"
        string_val: "click_seq_97285"
        string_val: "click_seq_59026"
        string_val: "click_seq_3895"
        string_val: "click_seq_5049"
        string_val: "click_seq_4810"
        string_val: "click_seq_6379"
        string_val: "click_seq_65802"
        string_val: "click_seq_4180"
        string_val: "click_seq_101"
        string_val: "click_seq_60737"
        string_val: "click_seq_88163"
        string_val: "click_seq_5477"
        string_val: "click_seq_46"
        string_val: "click_seq_7320"
        string_val: "click_seq_150401"
        string_val: "click_seq_1616"
        string_val: "click_seq_4171"
        string_val: "click_seq_73431"
        string_val: "click_seq_3981"
        string_val: "click_seq_310"
        string_val: "click_seq_1965"
        string_val: "click_seq_6754"
        string_val: "click_seq_117531"
        string_val: "click_seq_612"
        string_val: "click_seq_37830"
        string_val: "click_seq_78703"
        string_val: "click_seq_2405"
        string_val: "click_seq_4585"
        string_val: "click_seq_4710"
        string_val: "click_seq_176423"
        string_val: "click_seq_6918"
        string_val: "click_seq_30793"
        string_val: "click_seq_3889"
        string_val: "click_seq_1274"
        string_val: "click_seq_2389"
        string_val: "click_seq_1234"
        string_val: "click_seq_4885"
        string_val: "click_seq_6523"
        string_val: "click_seq_3704"
        string_val: "click_seq_2475"
        string_val: "click_seq_41617"
        string_val: "click_seq_51903"
        string_val: "click_seq_78349"
        string_val: "click_seq_79293"
        string_val: "click_seq_129313"
        string_val: "click_seq_1785"
        string_val: "click_seq_132660"
        string_val: "click_seq_3163"
        string_val: "click_seq_526"
        string_val: "click_seq_2472"
        string_val: "click_seq_44731"
        string_val: "click_seq_2451"
        string_val: "click_seq_1305"
        string_val: "click_seq_8979"
        string_val: "click_seq_5849"
        string_val: "click_seq_46530"
        string_val: "click_seq_102800"
        string_val: "click_seq_2741"
        string_val: "click_seq_130444"
        string_val: "click_seq_464"
        string_val: "click_seq_8337"
        string_val: "click_seq_7191"
        string_val: "click_seq_58839"
        string_val: "click_seq_105254"
        string_val: "click_seq_6289"
        string_val: "click_seq_160848"
        string_val: "click_seq_293"
        string_val: "click_seq_5620"
        string_val: "click_seq_2069"
        string_val: "click_seq_82744"
        string_val: "click_seq_4102"
        string_val: "click_seq_140016"
        string_val: "click_seq_103141"
        string_val: "click_seq_70183"
        string_val: "click_seq_129659"
        string_val: "click_seq_4673"
        string_val: "click_seq_6466"
        string_val: "click_seq_95147"
        string_val: "click_seq_27866"
        string_val: "click_seq_171023"
        string_val: "click_seq_68157"
        string_val: "click_seq_73266"
        string_val: "click_seq_133217"
        string_val: "click_seq_37736"
        string_val: "click_seq_1604"
        string_val: "click_seq_5240"
        string_val: "click_seq_84601"
        string_val: "click_seq_183897"
        string_val: "click_seq_107013"
        string_val: "click_seq_87520"
        string_val: "click_seq_1772"
        string_val: "click_seq_136598"
        string_val: "screen_year_2"
        string_val: "click_seq_45361"
        string_val: "click_seq_7080"
        string_val: "click_seq_2025"
        string_val: "click_seq_51935"
        string_val: "click_seq_3214"
        string_val: "click_seq_5493"
        string_val: "click_seq_134783"
        string_val: "click_seq_3280"
        string_val: "click_seq_338"
        string_val: "click_seq_26471"
        string_val: "click_seq_27674"
        string_val: "click_seq_1172"
        string_val: "click_seq_1246"
        string_val: "click_seq_8580"
        string_val: "click_seq_6945"
        string_val: "click_seq_613"
        string_val: "click_seq_6760"
        string_val: "click_seq_3130"
        string_val: "click_seq_1932"
        string_val: "click_seq_40583"
        string_val: "click_seq_26681"
        string_val: "click_seq_2298"
        string_val: "click_seq_5435"
        string_val: "click_seq_53318"
        string_val: "click_seq_138798"
        string_val: "click_seq_67197"
        string_val: "click_seq_127130"
        string_val: "click_seq_51540"
        string_val: "click_seq_98083"
        string_val: "click_seq_750"
        string_val: "click_seq_1953"
        string_val: "click_seq_2080"
        string_val: "click_seq_78620"
        string_val: "click_seq_188"
        string_val: "click_seq_3099"
        string_val: "click_seq_2881"
        string_val: "click_seq_47044"
        string_val: "click_seq_94405"
        string_val: "click_seq_6283"
        string_val: "click_seq_3746"
        string_val: "click_seq_6723"
        string_val: "click_seq_111360"
        string_val: "click_seq_7706"
        string_val: "click_seq_172229"
        string_val: "click_seq_2731"
        string_val: "click_seq_2288"
        string_val: "click_seq_592"
        string_val: "click_seq_39516"
        string_val: "click_seq_159976"
        string_val: "click_seq_6322"
        string_val: "click_seq_3434"
        string_val: "click_seq_234"
        string_val: "click_seq_63436"
        string_val: "click_seq_3634"
        string_val: "click_seq_32392"
        string_val: "click_seq_4463"
        string_val: "click_seq_5747"
        string_val: "click_seq_1054"
        string_val: "click_seq_480"
        string_val: "click_seq_2366"
        string_val: "click_seq_4912"
        string_val: "click_seq_7261"
        string_val: "click_seq_5810"
        string_val: "click_seq_1946"
        string_val: "click_seq_2052"
        string_val: "click_seq_148982"
        string_val: "click_seq_3737"
        string_val: "click_seq_7118"
        string_val: "click_seq_2828"
        string_val: "click_seq_128360"
        string_val: "click_seq_3467"
        string_val: "click_seq_151739"
        string_val: "click_seq_58"
        string_val: "click_seq_765"
        string_val: "click_seq_91658"
        string_val: "click_seq_5665"
        string_val: "click_seq_35807"
        string_val: "click_seq_156706"
        string_val: "click_seq_7107"
        string_val: "click_seq_82093"
        string_val: "click_seq_131480"
        string_val: "click_seq_3143"
        string_val: "click_seq_121"
        string_val: "click_seq_8518"
        string_val: "click_seq_168326"
        string_val: "click_seq_4343"
        string_val: "click_seq_3152"
        string_val: "click_seq_158398"
        string_val: "click_seq_138546"
        string_val: "click_seq_4128"
        string_val: "click_seq_5804"
        string_val: "click_seq_5112"
        string_val: "click_seq_25771"
        string_val: "click_seq_1179"
        string_val: "click_seq_2793"
        string_val: "click_seq_111663"
        string_val: "click_seq_2717"
        string_val: "click_seq_5353"
        string_val: "click_seq_8782"
        string_val: "click_seq_1646"
        string_val: "click_seq_115617"
        string_val: "click_seq_4033"
        string_val: "click_seq_68597"
        string_val: "click_seq_101973"
        string_val: "click_seq_3799"
        string_val: "click_seq_1310"
        string_val: "click_seq_3707"
        string_val: "click_seq_1783"
        string_val: "click_seq_1620"
        string_val: "click_seq_1805"
        string_val: "click_seq_482"
        string_val: "click_seq_8981"
        string_val: "click_seq_43"
        string_val: "click_seq_851"
        string_val: "click_seq_6932"
        string_val: "click_seq_5746"
        string_val: "click_seq_81831"
        string_val: "click_seq_3686"
        string_val: "click_seq_183611"
        string_val: "click_seq_6280"
        string_val: "click_seq_8773"
        string_val: "click_seq_7012"
        string_val: "click_seq_1793"
        string_val: "click_seq_27074"
        string_val: "click_seq_86345"
        string_val: "click_seq_91628"
        string_val: "click_seq_3618"
        string_val: "click_seq_174"
        string_val: "click_seq_6308"
        string_val: "click_seq_57772"
        string_val: "click_seq_1748"
        string_val: "click_seq_140289"
        string_val: "click_seq_3567"
        string_val: "click_seq_8813"
        string_val: "click_seq_1270"
        string_val: "click_seq_26542"
        string_val: "click_seq_2415"
        string_val: "click_seq_142456"
        string_val: "click_seq_7789"
        string_val: "click_seq_2032"
        string_val: "click_seq_6412"
        string_val: "click_seq_3269"
        string_val: "click_seq_93363"
        string_val: "click_seq_68159"
        string_val: "click_seq_54785"
        string_val: "click_seq_1221"
        string_val: "click_seq_3299"
        string_val: "click_seq_47950"
        string_val: "click_seq_112334"
        string_val: "click_seq_176051"
        string_val: "click_seq_116207"
        string_val: "click_seq_1992"
        string_val: "click_seq_111844"
        string_val: "click_seq_3705"
        string_val: "click_seq_44889"
        string_val: "click_seq_1580"
        string_val: "click_seq_26171"
        string_val: "click_seq_26958"
        string_val: "click_seq_4902"
        string_val: "click_seq_337"
        string_val: "click_seq_6662"
        string_val: "click_seq_172547"
        string_val: "click_seq_33138"
        string_val: "click_seq_103339"
        string_val: "click_seq_31116"
        string_val: "click_seq_4103"
        string_val: "click_seq_212"
        string_val: "click_seq_92348"
        string_val: "click_seq_5442"
        string_val: "click_seq_7312"
        string_val: "click_seq_26498"
        string_val: "click_seq_56757"
        string_val: "click_seq_27808"
        string_val: "click_seq_7444"
        string_val: "click_seq_6558"
        string_val: "click_seq_368"
        string_val: "click_seq_53993"
        string_val: "click_seq_2808"
        string_val: "click_seq_6568"
        string_val: "click_seq_2586"
        string_val: "click_seq_52715"
        string_val: "click_seq_6659"
        string_val: "click_seq_187"
        string_val: "click_seq_5238"
        string_val: "click_seq_60069"
        string_val: "click_seq_4291"
        string_val: "click_seq_2002"
        string_val: "click_seq_90428"
        string_val: "click_seq_141004"
        string_val: "click_seq_5093"
        string_val: "click_seq_6427"
        string_val: "click_seq_67295"
        string_val: "click_seq_4700"
        string_val: "click_seq_63768"
        string_val: "click_seq_60735"
        string_val: "click_seq_46347"
        string_val: "click_seq_4141"
        string_val: "click_seq_2889"
        string_val: "click_seq_113275"
        string_val: "click_seq_58306"
        string_val: "click_seq_170837"
        string_val: "click_seq_2137"
        string_val: "click_seq_2671"
        string_val: "click_seq_3477"
        string_val: "click_seq_121097"
        string_val: "click_seq_106487"
        string_val: "click_seq_43396"
        string_val: "click_seq_158956"
        string_val: "click_seq_4520"
        string_val: "click_seq_6016"
        string_val: "click_seq_102378"
        string_val: "click_seq_1216"
        string_val: "click_seq_8952"
        string_val: "click_seq_127198"
        string_val: "click_seq_6357"
        string_val: "click_seq_26554"
        string_val: "click_seq_1034"
        string_val: "click_seq_3052"
        string_val: "click_seq_8042"
        string_val: "click_seq_5663"
        string_val: "click_seq_74458"
        string_val: "click_seq_3243"
        string_val: "click_seq_151557"
        string_val: "click_seq_87660"
        string_val: "click_seq_49793"
        string_val: "click_seq_6636"
        string_val: "click_seq_446"
        string_val: "click_seq_1647"
        string_val: "click_seq_2953"
        string_val: "click_seq_177765"
        string_val: "click_seq_109416"
        string_val: "click_seq_471"
        string_val: "click_seq_142997"
        string_val: "click_seq_27899"
        string_val: "click_seq_2482"
        string_val: "click_seq_116941"
        string_val: "click_seq_58998"
        string_val: "click_seq_4518"
        string_val: "click_seq_131826"
        string_val: "click_seq_6302"
        string_val: "click_seq_225"
        string_val: "click_seq_3301"
        string_val: "click_seq_954"
        string_val: "click_seq_103883"
        string_val: "click_seq_3698"
        string_val: "click_seq_1479"
        string_val: "click_seq_3834"
        string_val: "click_seq_6402"
        string_val: "click_seq_40946"
        string_val: "click_seq_6603"
        string_val: "click_seq_135143"
        string_val: "click_seq_34534"
        string_val: "click_seq_4152"
        string_val: "click_seq_8424"
        string_val: "click_seq_1332"
        string_val: "click_seq_149406"
        string_val: "click_seq_1357"
        string_val: "click_seq_40870"
        string_val: "click_seq_4641"
        string_val: "click_seq_140523"
        string_val: "click_seq_1107"
        string_val: "click_seq_7079"
        string_val: "click_seq_9"
        string_val: "click_seq_7983"
        string_val: "click_seq_32649"
        string_val: "click_seq_8835"
        string_val: "click_seq_6998"
        string_val: "click_seq_105468"
        string_val: "click_seq_8685"
        string_val: "click_seq_1684"
        string_val: "click_seq_4562"
        string_val: "click_seq_71302"
        string_val: "click_seq_3774"
        string_val: "click_seq_296"
        string_val: "click_seq_5745"
        string_val: "click_seq_5959"
        string_val: "click_seq_427"
        string_val: "click_seq_26947"
        string_val: "click_seq_1096"
        string_val: "click_seq_105355"
        string_val: "click_seq_2546"
        string_val: "click_seq_1003"
        string_val: "click_seq_3024"
        string_val: "click_seq_165645"
        string_val: "click_seq_7321"
        string_val: "click_seq_88"
        string_val: "click_seq_46335"
        string_val: "click_seq_46578"
        string_val: "click_seq_3627"
        string_val: "click_seq_27829"
        string_val: "click_seq_4432"
        string_val: "click_seq_141799"
        string_val: "click_seq_56908"
        string_val: "click_seq_6006"
        string_val: "click_seq_49276"
        string_val: "click_seq_813"
        string_val: "click_seq_3606"
        string_val: "click_seq_49286"
        string_val: "click_seq_5612"
        string_val: "click_seq_112940"
        string_val: "click_seq_7477"
        string_val: "click_seq_34"
        string_val: "click_seq_115502"
        string_val: "click_seq_4366"
        string_val: "click_seq_75395"
        string_val: "click_seq_2006"
        string_val: "click_seq_104419"
        string_val: "click_seq_1322"
        string_val: "click_seq_4062"
        string_val: "click_seq_8143"
        string_val: "click_seq_183227"
        string_val: "click_seq_94953"
        string_val: "click_seq_110669"
        string_val: "click_seq_2708"
        string_val: "click_seq_6306"
        string_val: "click_seq_128968"
        string_val: "click_seq_49130"
        string_val: "click_seq_104076"
        string_val: "click_seq_1889"
        string_val: "click_seq_99191"
        string_val: "click_seq_757"
        string_val: "click_seq_8804"
        string_val: "click_seq_3429"
        string_val: "click_seq_4621"
        string_val: "click_seq_2450"
        string_val: "click_seq_1924"
        string_val: "click_seq_78499"
        string_val: "click_seq_6883"
        string_val: "click_seq_32584"
        string_val: "click_seq_2243"
        string_val: "click_seq_43908"
        string_val: "click_seq_4534"
        string_val: "click_seq_1907"
        string_val: "click_seq_79357"
        string_val: "click_seq_82378"
        string_val: "click_seq_8861"
        string_val: "click_seq_5784"
        string_val: "click_seq_105250"
        string_val: "click_seq_94777"
        string_val: "click_seq_7082"
        string_val: "click_seq_77800"
        string_val: "click_seq_5476"
        string_val: "click_seq_138204"
        string_val: "click_seq_4305"
        string_val: "click_seq_4442"
        string_val: "click_seq_7034"
        string_val: "click_seq_7440"
        string_val: "click_seq_112171"
        string_val: "click_seq_407"
        string_val: "click_seq_137595"
        string_val: "click_seq_5900"
        string_val: "click_seq_7460"
        string_val: "click_seq_3418"
        string_val: "click_seq_3400"
        string_val: "click_seq_62999"
        string_val: "click_seq_98203"
        string_val: "click_seq_48738"
        string_val: "click_seq_1210"
        string_val: "click_seq_1261"
        string_val: "click_seq_1230"
        string_val: "click_seq_2081"
        string_val: "click_seq_2590"
        string_val: "click_seq_86320"
        string_val: "click_seq_1114"
        string_val: "click_seq_55995"
        string_val: "click_seq_64839"
        string_val: "click_seq_2542"
        string_val: "click_seq_72737"
        string_val: "click_seq_6373"
        string_val: "click_seq_93272"
        string_val: "click_seq_7457"
        string_val: "click_seq_691"
        string_val: "click_seq_390"
        string_val: "click_seq_173873"
        string_val: "click_seq_26059"
        string_val: "click_seq_3161"
        string_val: "click_seq_4458"
        string_val: "click_seq_5889"
        string_val: "click_seq_64010"
        string_val: "click_seq_3181"
        string_val: "click_seq_5786"
        string_val: "click_seq_161830"
        string_val: "click_seq_173963"
        string_val: "click_seq_1623"
        string_val: "click_seq_3837"
        string_val: "click_seq_64716"
        string_val: "click_seq_40962"
        string_val: "click_seq_6800"
        string_val: "click_seq_1395"
        string_val: "click_seq_51471"
        string_val: "click_seq_95508"
        string_val: "click_seq_1476"
        string_val: "click_seq_48322"
        string_val: "screen_year_4"
        string_val: "click_seq_109687"
        string_val: "click_seq_1502"
        string_val: "click_seq_5609"
        string_val: "click_seq_59131"
        string_val: "click_seq_504"
        string_val: "click_seq_48043"
        string_val: "click_seq_184245"
        string_val: "click_seq_7266"
        string_val: "click_seq_73015"
        string_val: "click_seq_4449"
        string_val: "click_seq_59103"
        string_val: "click_seq_103624"
        string_val: "click_seq_96829"
        string_val: "click_seq_2328"
        string_val: "click_seq_7299"
        string_val: "click_seq_103688"
        string_val: "click_seq_7380"
        string_val: "click_seq_157270"
        string_val: "click_seq_2874"
        string_val: "click_seq_4964"
        string_val: "click_seq_58301"
        string_val: "click_seq_8641"
        string_val: "click_seq_82854"
        string_val: "click_seq_2020"
        string_val: "click_seq_109941"
        string_val: "click_seq_4083"
        string_val: "click_seq_44633"
        string_val: "click_seq_147282"
        string_val: "click_seq_803"
        string_val: "click_seq_27619"
        string_val: "click_seq_120919"
        string_val: "click_seq_1414"
        string_val: "click_seq_3798"
        string_val: "click_seq_77201"
        string_val: "click_seq_5501"
        string_val: "click_seq_4519"
        string_val: "click_seq_4298"
        string_val: "click_seq_1080"
        string_val: "click_seq_59037"
        string_val: "click_seq_74452"
        string_val: "click_seq_164280"
        string_val: "click_seq_1055"
        string_val: "click_seq_3728"
        string_val: "click_seq_90471"
        string_val: "click_seq_5890"
        string_val: "click_seq_1175"
        string_val: "click_seq_4670"
        string_val: "click_seq_79091"
        string_val: "click_seq_1994"
        string_val: "click_seq_5610"
        string_val: "click_seq_7257"
        string_val: "click_seq_5053"
        string_val: "click_seq_534"
        string_val: "click_seq_1255"
        string_val: "click_seq_30822"
        string_val: "click_seq_4517"
        string_val: "click_seq_110611"
        string_val: "click_seq_3643"
        string_val: "click_seq_189547"
        string_val: "click_seq_647"
        string_val: "click_seq_68"
        string_val: "click_seq_1135"
        string_val: "click_seq_96448"
        string_val: "click_seq_33660"
        string_val: "click_seq_2901"
        string_val: "click_seq_2120"
        string_val: "click_seq_4390"
        string_val: "click_seq_4784"
        string_val: "click_seq_1674"
        string_val: "click_seq_4304"
        string_val: "click_seq_103171"
        string_val: "click_seq_100163"
        string_val: "click_seq_157407"
        string_val: "click_seq_7055"
        string_val: "click_seq_5523"
        string_val: "click_seq_8665"
        string_val: "click_seq_113225"
        string_val: "click_seq_107436"
        string_val: "click_seq_7382"
        string_val: "click_seq_38061"
        string_val: "click_seq_56022"
        string_val: "click_seq_4785"
        string_val: "click_seq_2975"
        string_val: "click_seq_798"
        string_val: "click_seq_1856"
        string_val: "click_seq_122922"
        string_val: "click_seq_82"
        string_val: "click_seq_61246"
        string_val: "click_seq_466"
        string_val: "click_seq_2460"
        string_val: "click_seq_6300"
        string_val: "click_seq_69784"
        string_val: "click_seq_37382"
        string_val: "click_seq_26694"
        string_val: "click_seq_5438"
        string_val: "click_seq_4612"
        string_val: "click_seq_4164"
        string_val: "click_seq_2570"
        string_val: "click_seq_27769"
        string_val: "click_seq_2040"
        string_val: "click_seq_166526"
        string_val: "click_seq_58376"
        string_val: "click_seq_4994"
